Revit 2027 API
BuiltInFailures.RebarFailures.CoverTooLong Property
 Rebar Cover length is too large for host thickness.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CoverTooLong { get; }
Public Shared ReadOnly Property CoverTooLong As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CoverTooLong {
	FailureDefinitionId^ get ();
}
static member CoverTooLong : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace